In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')
from sklearn.preprocessing import StandardScaler,MinMaxScaler,OneHotEncoder,LabelEncoder

In [2]:
df=pd.read_csv('adult_with_headers (1).csv')

# 1

In [3]:
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education_num     0
marital_status    0
occupation        0
relationship      0
race              0
sex               0
capital_gain      0
capital_loss      0
hours_per_week    0
native_country    0
income            0
dtype: int64

In [4]:
df.duplicated().sum()

24

In [5]:
df.drop_duplicates(inplace=True)

In [6]:
df.duplicated().sum()

0

In [7]:
df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [8]:
df1=df.select_dtypes(include=[int,float])
df1

       age  fnlwgt  education_num  capital_gain  capital_loss  hours_per_week
0       39   77516             13          2174             0              40
1       50   83311             13             0             0              13
2       38  215646              9             0             0              40
3       53  234721              7             0             0              40
4       28  338409             13             0             0              40
...    ...     ...            ...           ...           ...             ...
32556   27  257302             12             0             0              38
32557   40  154374              9             0             0              40
32558   58  151910              9             0             0              40
32559   22  201490              9             0             0              20
32560   52  287927              9         15024             0              40

[32537 rows x 6 columns]

In [9]:
df2=df.select_dtypes(include=[object])
df2

,workclass,education,marital_status,occupation,relationship,race,sex,native_country,income
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,<=50K
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,<=50K
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,<=50K
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States,<=50K
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States,>50K
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States,<=50K
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States,<=50K
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States,>50K

In [10]:
sta=StandardScaler()
num_sta=pd.DataFrame(sta.fit_transform(df1),columns=df1.columns)
num_sta

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
0,0.030390,-1.063569,1.134777,0.148292,-0.216743,-0.035664
1,0.836973,-1.008668,1.134777,-0.145975,-0.216743,-2.222483
2,-0.042936,0.245040,-0.420679,-0.145975,-0.216743,-0.035664
3,1.056950,0.425752,-1.198407,-0.145975,-0.216743,-0.035664
4,-0.776193,1.408066,1.134777,-0.145975,-0.216743,-0.035664
...,...,...,...,...,...,...
32532,-0.849519,0.639678,0.745913,-0.145975,-0.216743,-0.197650
32533,0.103716,-0.335436,-0.420679,-0.145975,-0.216743,-0.035664
32534,1.423579,-0.358779,-0.420679,-0.145975,-0.216743,-0.035664
32535,-1.216148,0.110930,-0.420679,-0.145975,-0.216743,-1.655530
32536,0.983625,0.929812,-0.420679,1.887635,-0.216743,-0.035664

In [11]:
min=MinMaxScaler()
num_min=pd.DataFrame(min.fit_transform(df1),columns=df1.columns)
num_min.head()

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week
0,0.301370,0.044302,0.800000,0.02174,0.0,0.397959
1,0.452055,0.048238,0.800000,0.00000,0.0,0.122449
2,0.287671,0.138113,0.533333,0.00000,0.0,0.397959
3,0.493151,0.151068,0.400000,0.00000,0.0,0.397959
4,0.150685,0.221488,0.800000,0.00000,0.0,0.397959

Standard scaler can be used for the dataset having outliers
MinMax Scaler is more sensitive to dataset having outliers

# 2

In [12]:
df2.nunique()

workclass          9
education         16
marital_status     7
occupation        15
relationship       6
race               5
sex                2
native_country    42
income             2
dtype: int64

In [13]:
## Only sex,income is less than 5 category

In [14]:

df3=pd.get_dummies(df2,columns=['sex','income'],drop_first=True,dtype=int)
df3.head()

,workclass,education,marital_status,occupation,relationship,race,native_country,sex_ Male,income_ >50K
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,United-States,1,0
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,United-States,1,0
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,United-States,1,0
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,United-States,1,0
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Cuba,0,0

In [15]:
df5=df3.drop(columns=['workclass','education','marital_status','occupation','relationship','race','native_country'])
df5

       sex_ Male  income_ >50K
0              1             0
1              1             0
2              1             0
3              1             0
4              0             0
...          ...           ...
32556          0             0
32557          1             1
32558          0             0
32559          1             0
32560          0             1

[32537 rows x 2 columns]

In [16]:
df4=df2.drop(columns=['sex','income'])
df4

,workclass,education,marital_status,occupation,relationship,race,native_country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Cuba
...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,United-States
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,United-States
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,United-States
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,United-States
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,United-States

In [18]:

for col in df4:
    lab=LabelEncoder()
    df4[col]=lab.fit_transform(df4[col])
df4

,workclass,education,marital_status,occupation,relationship,race,native_country
0,7,9,4,1,1,4,39
1,6,9,2,4,0,4,39
2,4,11,0,6,1,4,39
3,4,1,2,6,0,2,39
4,4,9,2,10,5,2,5
...,...,...,...,...,...,...,...
32556,4,7,2,13,5,4,39
32557,4,11,2,7,0,4,39
32558,4,11,6,1,4,4,39
32559,4,11,4,1,3,4,39
32560,5,11,2,4,5,4,39

In [19]:
## One hot encoding is good for encoding less category columns
## Label Encoding can be used for more category columns

# 3

In [20]:
num_sta = num_sta.reset_index(drop=True)
df4 = df4.reset_index(drop=True)
df5 = df5.reset_index(drop=True)

In [21]:
data=pd.concat([num_sta,df4,df5],axis=1)
data

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week,workclass,education,marital_status,occupation,relationship,race,native_country,sex_ Male,income_ >50K
0,0.030390,-1.063569,1.134777,0.148292,-0.216743,-0.035664,7,9,4,1,1,4,39,1,0
1,0.836973,-1.008668,1.134777,-0.145975,-0.216743,-2.222483,6,9,2,4,0,4,39,1,0
2,-0.042936,0.245040,-0.420679,-0.145975,-0.216743,-0.035664,4,11,0,6,1,4,39,1,0
3,1.056950,0.425752,-1.198407,-0.145975,-0.216743,-0.035664,4,1,2,6,0,2,39,1,0
4,-0.776193,1.408066,1.134777,-0.145975,-0.216743,-0.035664,4,9,2,10,5,2,5,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32532,-0.849519,0.639678,0.745913,-0.145975,-0.216743,-0.197650,4,7,2,13,5,4,39,0,0
32533,0.103716,-0.335436,-0.420679,-0.145975,-0.216743,-0.035664,4,11,2,7,0,4,39,1,1
32534,1.423579,-0.358779,-0.420679,-0.145975,-0.216743,-0.035664,4,11,6,1,4,4,39,0,0
32535,-1.216148,0.110930,-0.420679,-0.145975,-0.216743,-1.655530,4,11,4,1,3,4,39,1,0
32536,0.983625,0.929812,-0.420679,1.887635,-0.216743,-0.035664,5,11,2,4,5,4,39,0,1

In [25]:
data['tot_hrs']=data['fnlwgt']* data['hours_per_week']
data['works_overtime'] = (data['hours_per_week'] > -0.035664).astype(int)
data

,age,fnlwgt,education_num,capital_gain,capital_loss,hours_per_week,workclass,education,marital_status,occupation,relationship,race,native_country,sex_ Male,income_ >50K,tot_hrs,works_overtime
0,0.030390,-1.063569,1.134777,0.148292,-0.216743,-0.035664,7,9,4,1,1,4,39,1,0,0.037931,1
1,0.836973,-1.008668,1.134777,-0.145975,-0.216743,-2.222483,6,9,2,4,0,4,39,1,0,2.241749,0
2,-0.042936,0.245040,-0.420679,-0.145975,-0.216743,-0.035664,4,11,0,6,1,4,39,1,0,-0.008739,1
3,1.056950,0.425752,-1.198407,-0.145975,-0.216743,-0.035664,4,1,2,6,0,2,39,1,0,-0.015184,1
4,-0.776193,1.408066,1.134777,-0.145975,-0.216743,-0.035664,4,9,2,10,5,2,5,0,0,-0.050217,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32532,-0.849519,0.639678,0.745913,-0.145975,-0.216743,-0.197650,4,7,2,13,5,4,39,0,0,-0.126433,0
32533,0.103716,-0.335436,-0.420679,-0.145975,-0.216743,-0.035664,4,11,2,7,0,4,39,1,1,0.011963,1
32534,1.423579,-0.358779,-0.420679,-0.145975,-0.216743,-0.035664,4,11,6,1,4,4,39,0,0,0.012795,1
32535,-1.216148,0.110930,-0.420679,-0.145975,-0.216743,-1.655530,4,11,4,1,3,4,39,1,0,-0.183647,0
32536,0.983625,0.929812,-0.420679,1.887635,-0.216743,-0.035664,5,11,2,4,5,4,39,0,1,-0.033161,1

In [26]:
## new feature  tot_hrs and works_overtime is added to get know more about the time they are working which can be useful for the prediction of income

In [30]:
skew=df1.skew()
print(skew)

age                0.557663
fnlwgt             1.447703
education_num     -0.309500
capital_gain      11.949403
capital_loss       4.592702
hours_per_week     0.228759
dtype: float64

In [37]:
for col in df1:
    if (df1[col].skew() > 0.5):  
        df1[col] = np.log1p(df1[col])

In [38]:
df1.skew()

age              -0.113879
fnlwgt           -0.842204
education_num    -0.309500
capital_gain      3.094667
capital_loss      4.305701
hours_per_week    0.228759
dtype: float64

In [ ]:
## To reduce the skewness and make all skewed numerical features closer to a normal distribution